[
    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/M1GJjHd/7.png",
        "review": "A brilliant portrayal of the Jazz Age in America, showcasing the disillusionment and decadence of the wealthy class. Fitzgerald's masterful prose not only delves into the extravagance of the era but also explores the complexities of human desires and the pursuit of the American Dream amidst moral decay.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Classic Fiction",
        "tags": ["Romance", "Drama"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/C6hmF52/1.png",
        "review":"A haunting vision of a dystopian future where totalitarianism reigns supreme, reminding us of the importance of freedom and individuality. Orwell's chilling narrative not only warns of the dangers of authoritarianism but also serves as a stark reflection on the nature of power and the manipulation of truth for political gain.",
        "totalPages": 328,
        "rating": 4.8,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Political"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 3,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/8c4LyGW/9.png",
        "review": "A poignant tale of racial injustice and moral growth, resonating with timeless themes of empathy and courage. Through the eyes of young Scout Finch, Lee navigates the complexities of prejudice and discrimination in the American South, delivering a narrative that not only captivates but also educates on the enduring struggle for equality.",
        "totalPages": 281,
        "rating": 4.7,
        "category": "Classic Fiction",
        "tags": ["Social Issues", "Coming-of-Age"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 4,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/txp86F9/8.png",
        "review": "A compelling exploration of teenage angst and alienation, capturing the essence of adolescent rebellion with unmatched authenticity. Salinger's protagonist, Holden Caulfield, serves as a voice for disenchanted youth, grappling with identity, conformity, and the search for meaning in a world he perceives as phony.",
        "totalPages": 277,
        "rating": 4.4,
        "category": "Classic Fiction",
        "tags": ["Coming-of-Age", "Existential"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 5,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/hBhv8Ct/6.png",
        "review": "A timeless romance intertwined with social commentary, showcasing Austen's wit and insight into human nature. Through the spirited Elizabeth Bennet and the enigmatic Mr. Darcy, Austen crafts a narrative that not only entertains but also critiques the societal norms of 19th-century England, highlighting the complexities of love, class, and personal integrity.",
        "totalPages": 279,
        "rating": 4.6,
        "category": "Classic Fiction",
        "tags": ["Romance", "Satire"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 6,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/J26PD87/5.png",
        "review":"A gripping dystopian saga that explores themes of power, survival, and sacrifice, leaving readers on the edge of their seats until the very end. Collins' dystopian vision of a divided society, where the wealthy oppress the impoverished through a televised fight to the death, not only captivates with its action-packed narrative but also prompts reflection on the consequences of unchecked authority and the resilience of the human spirit.",
        "totalPages": 1178,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Adventure", "Epic"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1954
    },
    {
        "bookId": 7,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://i.ibb.co/KGV7QhG/2.png",
        "review": "A chilling psychological thriller that keeps readers guessing until the final page, with its intricate plot twists and morally complex characters. Flynn's narrative of a missing wife and the ensuing media frenzy exposes the dark underbelly of marriage and deception, challenging readers to question the reliability of perception and the depths of human depravity.",
        "totalPages": 374,
        "rating": 4.3,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Action"],
        "publisher": "Scholastic Corporation",
        "yearOfPublishing": 2008
    },
    {
        "bookId": 8,
        "bookName": "Gone Girl",
        "author": "Gillian Flynn",
        "image": "https://i.ibb.co/ZN2KTD7/3.png",
        "review": "An epic fantasy masterpiece that transports readers to a richly imagined world filled with adventure, heroism, and profound themes. Tolkien's meticulously crafted universe, complete with its languages, cultures, and histories, serves as the backdrop for an epic quest that explores the triumph of good over evil and the enduring power of friendship and sacrifice.",
        "totalPages": 419,
        "rating": 4.6,
        "category": "Mystery",
        "tags": ["Suspense", "Psychological"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 9,
        "bookName": "The Road",
        "author": "Cormac McCarthy",
        "image": "https://i.ibb.co/dJZd8vp/4.png",
        "review": "A haunting post-apocalyptic tale of survival and the bond between father and son, stripped down to its raw emotional core. McCarthy's sparse yet evocative prose paints a bleak yet strangely beautiful landscape, where every step taken is a struggle for existence and every interaction is a testament to the enduring power of love and hope amidst the ashes of civilization.",
        "totalPages": 241,
        "rating": 4.2,
        "category": "Dystopian Fiction",
        "tags": ["Survival", "Fatherhood"],
        "publisher": "Alfred A. Knopf",
        "yearOfPublishing": 2006
    }
]
